garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F54Q71.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMSTART2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTART2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="START2" edc:mask="0xff" edc:name="START2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMSTART2U" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTART2U" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CB">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="START2" edc:mask="0xff" edc:name="START2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMPERS2" edc:desc="" edc:name="APMPERS2" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CC">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERS2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERS2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CC">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERS2" edc:mask="0xff" edc:name="APMPERS2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="BG" edc:mask="0x1" edc:name="BG" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR1" edc:mask="0x1" edc:name="FVR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR2" edc:mask="0x1" edc:name="FVR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCD" edc:mask="0x1" edc:name="ADCD" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCA" edc:mask="0x1" edc:name="ADCA" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_2" edc:mask="0x1" edc:name="APMPERS2_2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_3" edc:mask="0x1" edc:name="APMPERS2_3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_4" edc:mask="0x1" edc:name="APMPERS2_4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_5" edc:mask="0x1" edc:name="APMPERS2_5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_6" edc:mask="0x1" edc:name="APMPERS2_6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_7" edc:mask="0x1" edc:name="APMPERS2_7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERS2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERS2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CD">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERS2" edc:mask="0xff" edc:name="APMPERS2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="OPA1" edc:mask="0x1" edc:name="OPA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="OPA2" edc:mask="0x1" edc:name="OPA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1" edc:mask="0x1" edc:name="DAC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2" edc:mask="0x1" edc:name="DAC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3" edc:mask="0x1" edc:name="DAC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP1" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP2" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ZCD" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPERS2_8" edc:mask="0x1" edc:name="APMPERS2_8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_9" edc:mask="0x1" edc:name="APMPERS2_9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_10" edc:mask="0x1" edc:name="APMPERS2_10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_11" edc:mask="0x1" edc:name="APMPERS2_11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_12" edc:mask="0x1" edc:name="APMPERS2_12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_13" edc:mask="0x1" edc:name="APMPERS2_13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_14" edc:mask="0x1" edc:name="APMPERS2_14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS2_15" edc:mask="0x1" edc:name="APMPERS2_15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMEND1" edc:desc="" edc:name="APMEND1" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CE">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMEND1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CE">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END1" edc:mask="0xff" edc:name="END1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMEND1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1CF">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END1" edc:mask="0xff" edc:name="END1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND1U" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMEND1U" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END1" edc:mask="0xff" edc:name="END1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMPERE1" edc:desc="" edc:name="APMPERE1" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D1">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERE1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERE1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERE1" edc:mask="0xff" edc:name="APMPERE1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="BG" edc:mask="0x1" edc:name="BG" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR1" edc:mask="0x1" edc:name="FVR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR2" edc:mask="0x1" edc:name="FVR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCD" edc:mask="0x1" edc:name="ADCD" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCA" edc:mask="0x1" edc:name="ADCA" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_2" edc:mask="0x1" edc:name="APMPERE1_2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_3" edc:mask="0x1" edc:name="APMPERE1_3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_4" edc:mask="0x1" edc:name="APMPERE1_4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_5" edc:mask="0x1" edc:name="APMPERE1_5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_6" edc:mask="0x1" edc:name="APMPERE1_6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_7" edc:mask="0x1" edc:name="APMPERE1_7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERE1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERE1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERE1" edc:mask="0xff" edc:name="APMPERE1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="OPA1" edc:mask="0x1" edc:name="OPA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="OPA2" edc:mask="0x1" edc:name="OPA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1" edc:mask="0x1" edc:name="DAC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2" edc:mask="0x1" edc:name="DAC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3" edc:mask="0x1" edc:name="DAC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP1" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP2" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ZCD" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPERE1_8" edc:mask="0x1" edc:name="APMPERE1_8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_9" edc:mask="0x1" edc:name="APMPERE1_9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_10" edc:mask="0x1" edc:name="APMPERE1_10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_11" edc:mask="0x1" edc:name="APMPERE1_11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_12" edc:mask="0x1" edc:name="APMPERE1_12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_13" edc:mask="0x1" edc:name="APMPERE1_13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_14" edc:mask="0x1" edc:name="APMPERE1_14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE1_15" edc:mask="0x1" edc:name="APMPERE1_15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMEND2" edc:desc="" edc:name="APMEND2" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D3">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="APMEND2L" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END2" edc:mask="0xff" edc:name="END2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="APMEND2H" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D4">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END2" edc:mask="0xff" edc:name="END2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMEND2U" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="APMEND2U" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="END2" edc:mask="0xff" edc:name="END2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMPERE2" edc:desc="" edc:name="APMPERE2" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D6">
          <edc:SFRDef edc:access="nnnnnn--" edc:cname="APMPERE2L" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="APMPERE2L" edc:nzwidth="8" edc:por="000000--" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="BG" edc:mask="0x1" edc:name="BG" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR1" edc:mask="0x1" edc:name="FVR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR2" edc:mask="0x1" edc:name="FVR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCD" edc:mask="0x1" edc:name="ADCD" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCA" edc:mask="0x1" edc:name="ADCA" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="APMPERE2" edc:mask="0xff" edc:name="APMPERE2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_2" edc:mask="0x1" edc:name="APMPERE2_2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_3" edc:mask="0x1" edc:name="APMPERE2_3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_4" edc:mask="0x1" edc:name="APMPERE2_4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_5" edc:mask="0x1" edc:name="APMPERE2_5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_6" edc:mask="0x1" edc:name="APMPERE2_6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_7" edc:mask="0x1" edc:name="APMPERE2_7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERE2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERE2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D7">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERE2" edc:mask="0xff" edc:name="APMPERE2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="OPA1" edc:mask="0x1" edc:name="OPA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="OPA2" edc:mask="0x1" edc:name="OPA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1" edc:mask="0x1" edc:name="DAC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2" edc:mask="0x1" edc:name="DAC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3" edc:mask="0x1" edc:name="DAC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP1" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP2" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ZCD" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPERE2_8" edc:mask="0x1" edc:name="APMPERE2_8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_9" edc:mask="0x1" edc:name="APMPERE2_9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_10" edc:mask="0x1" edc:name="APMPERE2_10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_11" edc:mask="0x1" edc:name="APMPERE2_11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_12" edc:mask="0x1" edc:name="APMPERE2_12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_13" edc:mask="0x1" edc:name="APMPERE2_13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_14" edc:mask="0x1" edc:name="APMPERE2_14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERE2_15" edc:mask="0x1" edc:name="APMPERE2_15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="APMCLK" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="APMCLK" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x3" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="APMCLK" edc:mask="0x3" edc:name="APMCLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="APMCLK0" edc:mask="0x1" edc:name="APMCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLK1" edc:mask="0x1" edc:name="APMCLK1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="APMSTATUS" edc:desc="" edc:name="APMSTATUS" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D9">
          <edc:SFRDef edc:access="rrrrrr--" edc:cname="APMSTATUSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTATUSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1D9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMSTATUS" edc:mask="0xff" edc:name="APMSTATUS" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="BG" edc:mask="0x1" edc:name="BG" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR1" edc:mask="0x1" edc:name="FVR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR2" edc:mask="0x1" edc:name="FVR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCD" edc:mask="0x1" edc:name="ADCD" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCA" edc:mask="0x1" edc:name="ADCA" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_2" edc:mask="0x1" edc:name="APMSTATUS_2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_3" edc:mask="0x1" edc:name="APMSTATUS_3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_4" edc:mask="0x1" edc:name="APMSTATUS_4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_5" edc:mask="0x1" edc:name="APMSTATUS_5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_6" edc:mask="0x1" edc:name="APMSTATUS_6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_7" edc:mask="0x1" edc:name="APMSTATUS_7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
