garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F54Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x415">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x416">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF7" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x418">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELD0" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD1" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD2" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD3" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD4" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD5" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD6" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD7" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x419">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUD0" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD1" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD2" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD3" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD4" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD5" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD6" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD7" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCOND" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCD0" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD1" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD2" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD3" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD4" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD5" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD6" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD7" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
