garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F54Q71.PIC
      <edc:RegisterMirror edc:cnameref="TU16APRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TU16BPRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TU16BPRH" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x02"/>
      <edc:RegisterMirror edc:cnameref="TMR1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR3L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR3H" edc:cnamesuffix="M1"/>
    </edc:SFRDataSector>
  </edc:DMASpace>
  <edc:PinList edc:desc="PIC1856Q71 48-pin. TQFP" edc:ppsflavor="complex-port">
    <edc:Pin>
      <edc:VirtualPin edc:name="ANC7"/>
      <edc:VirtualPin edc:name="IOCC7"/>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="ANPC7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND4"/>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="ANPD4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND5"/>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="ANPD5"/>
      <edc:VirtualPin edc:name="ANND5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND6"/>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="ANPD6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND7"/>
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="ANPD7"/>
      <edc:VirtualPin edc:name="ANND7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="ZCD"/>
      <edc:VirtualPin edc:name="ANB0"/>
      <edc:VirtualPin edc:name="C2IN1+"/>
      <edc:VirtualPin edc:name="IOCB0"/>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="ANPB0"/>
      <edc:VirtualPin edc:name="ANNB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA2OUT"/>
      <edc:VirtualPin edc:name="OPA1IN3-"/>
      <edc:VirtualPin edc:name="OPA1IN3+"/>
      <edc:VirtualPin edc:name="ANB1"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="IOCB1"/>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="ANPB1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA2IN3-"/>
      <edc:VirtualPin edc:name="OPA2IN3+"/>
      <edc:VirtualPin edc:name="ANB2"/>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="IOCB2"/>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="ANPB2"/>
      <edc:VirtualPin edc:name="ANNB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA2IN2-"/>
      <edc:VirtualPin edc:name="OPA2IN2+"/>
      <edc:VirtualPin edc:name="ANB3"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
      <edc:VirtualPin edc:name="IOCB3"/>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="ANPB3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF4"/>
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="ANPF4"/>
      <edc:VirtualPin edc:name="ANNF4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF5"/>
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="ANPF5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF6"/>
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="ANPF6"/>
      <edc:VirtualPin edc:name="ANNF6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF7"/>
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="ANPF7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA2IN0-"/>
      <edc:VirtualPin edc:name="OPA2IN0+"/>
      <edc:VirtualPin edc:name="ANB4"/>
      <edc:VirtualPin edc:name="IOCB4"/>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="ANPB4"/>
      <edc:VirtualPin edc:name="ANNB4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="ANB5"/>
      <edc:VirtualPin edc:name="IOCB5"/>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="ANPB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ICSPCLK"/>
      <edc:VirtualPin edc:name="ICDCLK"/>
      <edc:VirtualPin edc:name="ANB6"/>
      <edc:VirtualPin edc:name="IOCB6"/>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="ANPB6"/>
      <edc:VirtualPin edc:name="ANNB6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ICSPDAT"/>
      <edc:VirtualPin edc:name="ICDDAT"/>
      <edc:VirtualPin edc:name="DAC1OUT2"/>
      <edc:VirtualPin edc:name="DAC2OUT2"/>
      <edc:VirtualPin edc:name="DAC3OUT2"/>
      <edc:VirtualPin edc:name="ANB7"/>
      <edc:VirtualPin edc:name="IOCB7"/>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="ANPB7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VPP"/>
      <edc:VirtualPin edc:name="MCLR_n"/>
      <edc:VirtualPin edc:name="ICDMCLR_n"/>
      <edc:VirtualPin edc:name="IOCE3"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA0"/>
      <edc:VirtualPin edc:name="C1IN0-"/>
      <edc:VirtualPin edc:name="C2IN0-"/>
      <edc:VirtualPin edc:name="IOCA0"/>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="ANPA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA1OUT"/>
      <edc:VirtualPin edc:name="OPA2IN1-"/>
      <edc:VirtualPin edc:name="OPA2IN1+"/>
      <edc:VirtualPin edc:name="ANA1"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="IOCA1"/>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="ANPA1"/>
      <edc:VirtualPin edc:name="ANNA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DAC1OUT1"/>
      <edc:VirtualPin edc:name="DAC2OUT1"/>
      <edc:VirtualPin edc:name="DAC3OUT1"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="OPA1IN0-"/>
      <edc:VirtualPin edc:name="OPA1IN0+"/>
      <edc:VirtualPin edc:name="ANA2"/>
      <edc:VirtualPin edc:name="C1IN0+"/>
      <edc:VirtualPin edc:name="C2IN0+"/>
      <edc:VirtualPin edc:name="IOCA2"/>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="ANPA2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="ANA3"/>
      <edc:VirtualPin edc:name="C1IN1+"/>
      <edc:VirtualPin edc:name="IOCA3"/>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="ANPA3"/>
      <edc:VirtualPin edc:name="ANNA3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA1IN1-"/>
      <edc:VirtualPin edc:name="OPA1IN1+"/>
      <edc:VirtualPin edc:name="ANA4"/>
      <edc:VirtualPin edc:name="IOCA4"/>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="ANPA4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OPA1IN2-"/>
      <edc:VirtualPin edc:name="OPA1IN2+"/>
      <edc:VirtualPin edc:name="ANA5"/>
      <edc:VirtualPin edc:name="IOCA5"/>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="ANPA5"/>
      <edc:VirtualPin edc:name="ANNA5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANE0"/>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="ANPE0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANE1"/>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="ANPE1"/>
      <edc:VirtualPin edc:name="ANNE1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANE2"/>
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="ANPE2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="ANA7"/>
      <edc:VirtualPin edc:name="IOCA7"/>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="ANPA7"/>
      <edc:VirtualPin edc:name="ANNA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="ANA6"/>
      <edc:VirtualPin edc:name="IOCA6"/>
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="ANPA6"/>
      <edc:VirtualPin edc:name="ANNA6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="ANC0"/>
      <edc:VirtualPin edc:name="IOCC0"/>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="ANPC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="ANC1"/>
      <edc:VirtualPin edc:name="IOCC1"/>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="ANPC1"/>
      <edc:VirtualPin edc:name="ANNC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF0"/>
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="ANPF0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF1"/>
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="ANPF1"/>
      <edc:VirtualPin edc:name="ANNF1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF2"/>
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="ANPF2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANF3"/>
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="ANPF3"/>
      <edc:VirtualPin edc:name="ANNF3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="ANC2"/>
      <edc:VirtualPin edc:name="IOCC2"/>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="ANPC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="ANC3"/>
      <edc:VirtualPin edc:name="IOCC3"/>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="ANPC3"/>
      <edc:VirtualPin edc:name="ANNC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND0"/>
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="ANPD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND1"/>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="ANPD1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND2"/>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="ANPD2"/>
      <edc:VirtualPin edc:name="ANND2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AND3"/>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="ANPD3"/>
      <edc:VirtualPin edc:name="ANND3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="ANC4"/>
      <edc:VirtualPin edc:name="IOCC4"/>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="ANPC4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="ANC5"/>
      <edc:VirtualPin edc:name="IOCC5"/>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="ANPC5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANC6"/>
      <edc:VirtualPin edc:name="IOCC6"/>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="ANPC6"/>
      <edc:VirtualPin edc:name="ANNC6"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B W">
      <edc:VirtualPin edc:name="INT0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="INT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B F W">
      <edc:VirtualPin edc:name="INT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A F W">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C E W">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C W">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C E W">
      <edc:VirtualPin edc:name="T3CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="T3G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="T2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C W">
      <edc:VirtualPin edc:name="T4IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C E W">
      <edc:VirtualPin edc:name="TUIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B F W">
      <edc:VirtualPin edc:name="TUIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C F W">
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C F W">
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C F W">
      <edc:VirtualPin edc:name="PWMIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A E W">
      <edc:VirtualPin edc:name="PWMIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="PWM1ERS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C E W">
      <edc:VirtualPin edc:name="PWM2ERS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="PWM3ERS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="CLCIN4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C W">
      <edc:VirtualPin edc:name="CLCIN5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="CLCIN6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="CLCIN7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="ADACT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C W">
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C W">
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D W">
      <edc:VirtualPin edc:name="SS1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C F W">
      <edc:VirtualPin edc:name="RX1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="C F">
      <edc:VirtualPin edc:name="CTS1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D W">
      <edc:VirtualPin edc:name="RX2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CTS2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="OPA1OR"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="OPA2OR"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="APMCLK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C D E F">
      <edc:VirtualPin edc:name="ADGRDB" edc:ppsval="0x28"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A B C D E F">
      <edc:VirtualPin edc:name="ADGRDA" edc:ppsval="0x27"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B E">
      <edc:VirtualPin edc:name="CLKR" edc:ppsval="0x26"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="NCO1" edc:ppsval="0x25"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="TU16B" edc:ppsval="0x24"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="TU16A" edc:ppsval="0x23"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="TMR0" edc:ppsval="0x22"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA1" edc:ppsval="0x21"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL1" edc:ppsval="0x20"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="SS1" edc:ppsval="0x1F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDO1" edc:ppsval="0x1E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK1" edc:ppsval="0x1D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A E">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="0x1C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="0x1B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="RTS2" edc:ppsval="0x1A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="TXDE2" edc:ppsval="0x19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="TX2" edc:ppsval="0x18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="RTS1" edc:ppsval="0x17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="TXDE1" edc:ppsval="0x16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="TX1" edc:ppsval="0x15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="PWM32" edc:ppsval="0x14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="PWM31" edc:ppsval="0x13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="PWM22" edc:ppsval="0x12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="PWM21" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="PWM12" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="C F">
      <edc:VirtualPin edc:name="PWM11" edc:ppsval="0x0F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0x0E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x0D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1D" edc:ppsval="0x0C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1C" edc:ppsval="0x0B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CWG1B" edc:ppsval="0x0A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CWG1A" edc:ppsval="0x09"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC8" edc:ppsval="0x08"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC7" edc:ppsval="0x07"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A F">
      <edc:VirtualPin edc:name="CLC6" edc:ppsval="0x06"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A F">
      <edc:VirtualPin edc:name="CLC5" edc:ppsval="0x05"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC4" edc:ppsval="0x04"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC3" edc:ppsval="0x03"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A F">
      <edc:VirtualPin edc:name="CLC2" edc:ppsval="0x02"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A F">
      <edc:VirtualPin edc:name="CLC1" edc:ppsval="0x01"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
